In [33]:
import pandas as pd

In [34]:
d = {"a":[1,2,3,4],"b":[5,6,7,8]}
var1 = pd.DataFrame(d)

In [35]:
var2 = var1.to_csv("Test.csv")

In [93]:
var3 = pd.read_csv("C:\\Users\\vishal\\Test.csv")

In [90]:
var3

   Unnamed: 0  a  b
0           0  1  5
1           1  2  6
2           2  3  7
3           3  4  8

In [38]:
var4 = pd.read_csv("C:\\Users\\vishal\\Test.csv", nrows = 1)

In [39]:
var4

   Unnamed: 0  a  b
0           0  1  5

In [64]:
var5 = pd.read_csv("Test.csv", usecols = ["a"])

In [65]:
var5

   a
0  1
1  2
2  3
3  4

In [94]:
# var1.insert(1,"python_12",[22,33,44,55])

In [95]:
var1

   a  python_12  python_1  b
0  1         22         9  5
1  2         33        10  6
2  3         44        11  7
3  4         55        12  8

In [84]:
#  pd.read_csv("C:\\Users\\vishal\\Test.csv",usecols=["python_12"])

In [83]:
# var6

In [122]:
var7 = pd.read_csv(("C:\\Users\\vishal\\Test.csv"),skiprows=[2])

In [123]:
var7

   Unnamed: 0  a  b
0           0  1  5
1           2  3  7
2           3  4  8

In [133]:
var8 = pd.read_csv("C:\\Users\\vishal\\Test.csv",index_col="b")

In [134]:
var8

   Unnamed: 0  a
b
5           0  1
6           1  2
7           2  3
8           3  4

In [143]:
var3

   Unnamed: 0  a  b
0           0  1  5
1           1  2  6
2           2  3  7
3           3  4  8

In [148]:
var9 = pd.read_csv("C:\\Users\\vishal\\Test.csv",header = 2)

In [149]:
var9

   1  2  6
0  2  3  7
1  3  4  8

In [152]:
var10 = pd.read_csv("C:\\Users\\vishal\\Test.csv",names= ["index","col1","col2"])

In [153]:
var10

   index col1 col2
0    NaN    a    b
1    0.0    1    5
2    1.0    2    6
3    2.0    3    7
4    3.0    4    8

In [154]:
var11 = pd.read_csv("C:\\Users\\vishal\\Test.csv",header = None)

In [155]:
var11

     0  1  2
0  NaN  a  b
1  0.0  1  5
2  1.0  2  6
3  2.0  3  7
4  3.0  4  8

In [156]:
var12 = pd.read_csv("C:\\Users\\vishal\\Test.csv",header = None, prefix ="col")

C:\Users\vishal\AppData\Local\Temp\ipykernel_6648\844092092.py:1: FutureWarning: The prefix argument has been deprecated and will be removed in a future version. Use a list comprehension on the column names in the future.


  var12 = pd.read_csv("C:\\Users\\vishal\\Test.csv",header = None, prefix ="col")

In [157]:
var12

   col0 col1 col2
0   NaN    a    b
1   0.0    1    5
2   1.0    2    6
3   2.0    3    7
4   3.0    4    8

In [159]:
var13 = pd.read_csv("C:\\Users\\vishal\\Test.csv",dtype={ "a":float})

In [160]:
var13

   Unnamed: 0    a  b
0           0  1.0  5
1           1  2.0  6
2           2  3.0  7
3           3  4.0  8